'use strict';

// ------------------- Task 1 -------------------------------

// let money = prompt('Ваш бюджет на месяц',);
// let time = prompt('Введите дату в формате YYYY-MM-DD',);


//  -------------------- Task 2 ------------------------------
//Какое будет выведено значение: +
//let x = 5;
// alert(x++); // верно - алерт выведет 5, ++х выведет 6;

// Чему равно такое выражение: 
[ ] + false - null + true 

// Что выведет этот код: +
// let y = 1; 
// let x = y = 2; 
// alert(x); // верно - алерт выведет 2;

// //Чему равна сумма 
// [ ] + 1 + 2 

// //Что выведет этот код: 
// alert( "1"[0] ) 

// //Чему равно +
// 2 && 1 && null && 0 && undefined // верно - алерт выведет null;

// //Есть ли разница между выражениями? -
//console.log(!!( a && b ) === (a && b)); // неверно - алерт выведет false
//произошло преобразование к булевому типу

// //Что выведет этот код: +
//alert( null || 2 && 3 || 4 ); // верно - алерт выведет 3

// //Правда ли что a == b ?
// a = [1, 2, 3]; b = [1, 2, 3]; 

// //Что выведет этот код: +-
//alert( +"Infinity" ); // Infinity. Но Инфинити - число, потому
//что преобразование к числовому типу (console.log(typeof(+"Infinity")))

// //Верно ли сравнение: +
// console.log("ёжик" > "яблоко") // верно - алерт выведет true;

// //Чему равно +
// console.log( 0 || "" || 2 || undefined || true || falsе ) // верно - алерт выведет 2

// --------------------- Task 3 -------------------------------